---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsEnabled
source: html/5e06f0e4-2980-403f-79d8-a58c70dd5a3e.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsEnabled Property

Identifies if any radial or diameter dimensions will be shown or not.

## Syntax (C#)
```csharp
public bool BendDiameterDimensionsEnabled { get; set; }
```